#
#
#
# 4. 시본 Seaborn
#
#  - 시본 Seaborn 라이브러리는 맷플로립을 기반으로 다양한 테마와 통계용 차트 등의 동적인 기능을 추가한 라이브러리
#
#  - 시본 라이브러리는 맷플로립과 다르게 통계와 관련된 차트를 제공하기 때문에
#
#  - 데이터프레임으로 다양한 통계 지표를 만들어 낼 수 있으며 데이터 분석에 활발하게 사용되고 있음
#
#
#
#  - 시본 라이브러리로 그리는 그래프들은 크게 관계형, 분포형, 카테고리형의 세가지 범주로 분류할 수 있는데,
#
#  - 실제 분석에는 맷플로립과 시본 라이브러리 두 가지를 함께 사용
#
#  - 시본 라이브러리를 사용할 때 시본이 맷플로립에 의존적이기 때문에 맷프로립 라이브러리도 함께 임포트 해야함
#
#
#
#  - 시본 라이브러리의 주요 특징
#
#  - 1) 뛰어난 시각화 효과 2) 간결한 구문 제공 3) 판다스 데이터프레임에 최적화 4) 쉬운 데이터프레임 집계 및 차트 요약
#
#
#
#  - 시본 라이브러리는 기본적으로 맷플로립보다 제공하는 색상이 더 많기에 색 표현력이 좋음
#
#  - 맷플로립으로 그래프를 표현하더라도 시본의 set() 함수를 미리 선언해 주면 자동으로 시본 팔레트에 출력
#
#  - 시본은 'deep, muted, pastel, bright, dark, colorblind'의 6개 기본 팔레트를 제공
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
